// miniprogram/pages/tips/tips.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    text:[
      '1.选择你所想管理的时间周期，接下来的时间安排将围绕这段时间开展。',
      '2.填写您的详情时间表。\n 如：早上上课课时：第一节课8:30（开始时间）+持续时间',
      '3.通过您的详细时间表得出您可利用的破碎时间，并进行深度编辑。',
      '4.填写完以上两类时间表，即可开始当前周期的时间管理，直到周期结束。',
      '5.在时间管理进行过程中，可以重新修改破碎时间表的安排内容。（详细时间表不可二次修改',
      '6.每次经过一个破碎时间事件结点，将可以对该时间结点进行效率评价。',
      '7.时间管理周期结束后，您可以回顾这一周期的事件及利用效率，并开始下一次时间周期管理'
    ]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {

  }
})